10/data/attachments/3f1cf278a5b38270.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_335b587d-4b17-491c-beab-a5e09d5c7364</nif:username>
            <nif:friendToBeAdded>Katie_name_Friend_91112_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>